exampleCase/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    Inlet
    {
        type            fixedValue;
	  value           uniform 12.75;
    }

    Outlet
    {
        type            zeroGradient;
    }

    Top
    {
        type            zeroGradient;
    }

    Bottom
    {
        type            zeroGradient;
    }

    Front
    {
        type            empty;
    }
    Back
    {
        type            empty;
    }
}

// ************************************************************************* //
