exampleCase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;
vertices
(
	(0.0 0.06119499999999989 0)
	(0.677166 0.15388500000000005 0)
	(0.677166 3.229985 0)
	(0.0 3.3226750000000003 0)
	(0.0 0.06119499999999989 0.001)
	(0.677166 0.15388500000000005 0.001)
	(0.677166 3.229985 0.001)
	(0.0 3.3226750000000003 0.001)
	(0.973002 0.2104999999999999 0)
	(0.973002 3.1733700000000002 0)
	(0.973002 0.2104999999999999 0.001)
	(0.973002 3.1733700000000002 0.001)
	(1.25462 0.302465 0)
	(1.25462 3.081405 0)
	(1.25462 0.302465 0.001)
	(1.25462 3.081405 0.001)
	(1.82121 0.48033499999999996 0)
	(1.82121 2.9035349999999998 0)
	(1.82121 0.48033499999999996 0.001)
	(1.82121 2.9035349999999998 0.001)
	(2.41067 0.575885 0)
	(2.41067 2.807985 0)
	(2.41067 0.575885 0.001)
	(2.41067 2.807985 0.001)
	(2.76176 0.5949849999999999 0)
	(2.76176 2.788885 0)
	(2.76176 0.5949849999999999 0.001)
	(2.76176 2.788885 0.001)
	(3.1434 0.6076900000000001 0)
	(3.1434 2.77618 0)
	(3.1434 0.6076900000000001 0.001)
	(3.1434 2.77618 0.001)
	(3.44111 0.6326099999999999 0)
	(3.44111 2.7512600000000003 0)
	(3.44111 0.6326099999999999 0.001)
	(3.44111 2.7512600000000003 0.001)
	(3.96799 0.69733 0)
	(3.96799 2.68654 0)
	(3.96799 0.69733 0.001)
	(3.96799 2.68654 0.001)
	(4.38465 0.70244 0)
	(4.38465 2.6814299999999998 0)
	(4.38465 0.70244 0.001)
	(4.38465 2.6814299999999998 0.001)
	(4.57905 0.6924 0)
	(4.57905 2.69147 0)
	(4.57905 0.6924 0.001)
	(4.57905 2.69147 0.001)
	(4.77359 0.6607350000000001 0)
	(4.77359 2.723135 0)
	(4.77359 0.6607350000000001 0.001)
	(4.77359 2.723135 0.001)
	(4.86107 0.6443699999999999 0)
	(4.86107 2.7395 0)
	(4.86107 0.6443699999999999 0.001)
	(4.86107 2.7395 0.001)
	(5.23452 0.56002 0)
	(5.23452 2.82385 0)
	(5.23452 0.56002 0.001)
	(5.23452 2.82385 0.001)
	(5.3796 0.5283100000000001 0)
	(5.3796 2.8555599999999997 0)
	(5.3796 0.5283100000000001 0.001)
	(5.3796 2.8555599999999997 0.001)
	(5.56568 0.51057 0)
	(5.56568 2.8733 0)
	(5.56568 0.51057 0.001)
	(5.56568 2.8733 0.001)
	(5.89934 0.529415 0)
	(5.89934 2.8544549999999997 0)
	(5.89934 0.529415 0.001)
	(5.89934 2.8544549999999997 0.001)
	(6.24679 0.561955 0)
	(6.24679 2.8219149999999997 0)
	(6.24679 0.561955 0.001)
	(6.24679 2.8219149999999997 0.001)
	(6.71843 0.5815999999999999 0)
	(6.71843 2.80227 0)
	(6.71843 0.5815999999999999 0.001)
	(6.71843 2.80227 0.001)
	(7.01437 0.5715600000000001 0)
	(7.01437 2.81231 0)
	(7.01437 0.5715600000000001 0.001)
	(7.01437 2.81231 0.001)
	(7.38508 0.53487 0)
	(7.38508 2.849 0)
	(7.38508 0.53487 0.001)
	(7.38508 2.849 0.001)
	(7.75056 0.48629999999999995 0)
	(7.75056 2.89757 0)
	(7.75056 0.48629999999999995 0.001)
	(7.75056 2.89757 0.001)
	(8.04981 0.45194 0)
	(8.04981 2.93193 0)
	(8.04981 0.45194 0.001)
	(8.04981 2.93193 0.001)
	(8.23676 0.4398249999999999 0)
	(8.23676 2.944045 0)
	(8.23676 0.4398249999999999 0.001)
...
);
blocks
(
	hex (0 1 2 3 4 5 6 7) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (1 8 9 2 5 10 11 6) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (8 12 13 9 10 14 15 11) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (12 16 17 13 14 18 19 15) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (16 20 21 17 18 22 23 19) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (20 24 25 21 22 26 27 23) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (24 28 29 25 26 30 31 27) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (28 32 33 29 30 34 35 31) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (32 36 37 33 34 38 39 35) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (36 40 41 37 38 42 43 39) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (40 44 45 41 42 46 47 43) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (44 48 49 45 46 50 51 47) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (48 52 53 49 50 54 55 51) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (52 56 57 53 54 58 59 55) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (56 60 61 57 58 62 63 59) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (60 64 65 61 62 66 67 63) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (64 68 69 65 66 70 71 67) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (68 72 73 69 70 74 75 71) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (72 76 77 73 74 78 79 75) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (76 80 81 77 78 82 83 79) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (80 84 85 81 82 86 87 83) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (84 88 89 85 86 90 91 87) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (88 92 93 89 90 94 95 91) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (92 96 97 93 94 98 99 95) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (96 100 101 97 98 102 103 99) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (100 104 105 101 102 106 107 103) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (104 108 109 105 106 110 111 107) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (108 112 113 109 110 114 115 111) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (112 116 117 113 114 118 119 115) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (116 120 121 117 118 122 123 119) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (120 124 125 121 122 126 127 123) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (124 128 129 125 126 130 131 127) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (128 132 133 129 130 134 135 131) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (132 136 137 133 134 138 139 135) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (136 140 141 137 138 142 143 139) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (140 144 145 141 142 146 147 143) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (144 148 149 145 146 150 151 147) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (148 152 153 149 150 154 155 151) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (152 156 157 153 154 158 159 155) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (156 160 161 157 158 162 163 159) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (160 164 165 161 162 166 167 163) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (164 168 169 165 166 170 171 167) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (168 172 173 169 170 174 175 171) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (172 176 177 173 174 178 179 175) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (176 180 181 177 178 182 183 179) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (180 184 185 181 182 186 187 183) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (184 188 189 185 186 190 191 187) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (188 192 193 189 190 194 195 191) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (192 196 197 193 194 198 199 195) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (196 200 201 197 198 202 203 199) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (200 204 205 201 202 206 207 203) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (204 208 209 205 206 210 211 207) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (208 212 213 209 210 214 215 211) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (212 216 217 213 214 218 219 215) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (216 220 221 217 218 222 223 219) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (220 224 225 221 222 226 227 223) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (224 228 229 225 226 230 231 227) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (228 232 233 229 230 234 235 231) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (232 236 237 233 234 238 239 235) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (236 240 241 237 238 242 243 239) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (240 244 245 241 242 246 247 243) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (244 248 249 245 246 250 251 247) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (248 252 253 249 250 254 255 251) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (252 256 257 253 254 258 259 255) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (256 260 261 257 258 262 263 259) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (260 264 265 261 262 266 267 263) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (264 268 269 265 266 270 271 267) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (268 272 273 269 270 274 275 271) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (272 276 277 273 274 278 279 275) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (276 280 281 277 278 282 283 279) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (280 284 285 281 282 286 287 283) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (284 288 289 285 286 290 291 287) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (288 292 293 289 290 294 295 291) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (292 296 297 293 294 298 299 295) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (296 300 301 297 298 302 303 299) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (300 304 305 301 302 306 307 303) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (304 308 309 305 306 310 311 307) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (308 312 313 309 310 314 315 311) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (312 316 317 313 314 318 319 315) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (316 320 321 317 318 322 323 319) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (320 324 325 321 322 326 327 323) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (324 328 329 325 326 330 331 327) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (328 332 333 329 330 334 335 331) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (332 336 337 333 334 338 339 335) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (336 340 341 337 338 342 343 339) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (340 344 345 341 342 346 347 343) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (344 348 349 345 346 350 351 347) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (348 352 353 349 350 354 355 351) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (352 356 357 353 354 358 359 355) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (356 360 361 357 358 362 363 359) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (360 364 365 361 362 366 367 363) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (364 368 369 365 366 370 371 367) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (368 372 373 369 370 374 375 371) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (372 376 377 373 374 378 379 375) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (376 380 381 377 378 382 383 379) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (380 384 385 381 382 386 387 383) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (384 388 389 385 386 390 391 387) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (388 392 393 389 390 394 395 391) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
	hex (392 396 397 393 394 398 399 395) (8 60 1) simpleGrading (1 ((0.5 0.5 10) (0.5 0.5 0.1)) 1)
);

edges
(
);

boundary
(
	Top
	{
		type wall;
		faces
		(
			(7 6 2 3)
			(6 11 9 2)
			(11 15 13 9)
			(15 19 17 13)
			(19 23 21 17)
			(23 27 25 21)
			(27 31 29 25)
			(31 35 33 29)
			(35 39 37 33)
			(39 43 41 37)
			(43 47 45 41)
			(47 51 49 45)
			(51 55 53 49)
			(55 59 57 53)
			(59 63 61 57)
			(63 67 65 61)
			(67 71 69 65)
			(71 75 73 69)
			(75 79 77 73)
			(79 83 81 77)
			(83 87 85 81)
			(87 91 89 85)
			(91 95 93 89)
			(95 99 97 93)
			(99 103 101 97)
			(103 107 105 101)
			(107 111 109 105)
			(111 115 113 109)
			(115 119 117 113)
			(119 123 121 117)
			(123 127 125 121)
			(127 131 129 125)
			(131 135 133 129)
			(135 139 137 133)
			(139 143 141 137)
			(143 147 145 141)
			(147 151 149 145)
			(151 155 153 149)
			(155 159 157 153)
			(159 163 161 157)
			(163 167 165 161)
			(167 171 169 165)
			(171 175 173 169)
			(175 179 177 173)
			(179 183 181 177)
			(183 187 185 181)
			(187 191 189 185)
			(191 195 193 189)
			(195 199 197 193)
			(199 203 201 197)
			(203 207 205 201)
			(207 211 209 205)
			(211 215 213 209)
			(215 219 217 213)
			(219 223 221 217)
			(223 227 225 221)
			(227 231 229 225)
			(231 235 233 229)
			(235 239 237 233)
			(239 243 241 237)
			(243 247 245 241)
			(247 251 249 245)
			(251 255 253 249)
			(255 259 257 253)
			(259 263 261 257)
			(263 267 265 261)
			(267 271 269 265)
			(271 275 273 269)
			(275 279 277 273)
			(279 283 281 277)
			(283 287 285 281)
			(287 291 289 285)
			(291 295 293 289)
			(295 299 297 293)
			(299 303 301 297)
			(303 307 305 301)
			(307 311 309 305)
			(311 315 313 309)
			(315 319 317 313)
			(319 323 321 317)
			(323 327 325 321)
			(327 331 329 325)
			(331 335 333 329)
			(335 339 337 333)
			(339 343 341 337)
			(343 347 345 341)
			(347 351 349 345)
			(351 355 353 349)
			(355 359 357 353)
			(359 363 361 357)
			(363 367 365 361)
			(367 371 369 365)
			(371 375 373 369)
			(375 379 377 373)
			(379 383 381 377)
			(383 387 385 381)
			(387 391 389 385)
			(391 395 393 389)
			(395 399 397 393)
		);
	}
	Bottom
	{
		type wall;
		faces
		(
			(0 1 5 4)
			(1 8 10 5)
			(8 12 14 10)
			(12 16 18 14)
			(16 20 22 18)
			(20 24 26 22)
			(24 28 30 26)
			(28 32 34 30)
			(32 36 38 34)
			(36 40 42 38)
			(40 44 46 42)
			(44 48 50 46)
			(48 52 54 50)
			(52 56 58 54)
			(56 60 62 58)
			(60 64 66 62)
			(64 68 70 66)
			(68 72 74 70)
			(72 76 78 74)
			(76 80 82 78)
			(80 84 86 82)
			(84 88 90 86)
			(88 92 94 90)
			(92 96 98 94)
			(96 100 102 98)
			(100 104 106 102)
			(104 108 110 106)
			(108 112 114 110)
			(112 116 118 114)
			(116 120 122 118)
			(120 124 126 122)
			(124 128 130 126)
			(128 132 134 130)
			(132 136 138 134)
			(136 140 142 138)
			(140 144 146 142)
			(144 148 150 146)
			(148 152 154 150)
			(152 156 158 154)
			(156 160 162 158)
			(160 164 166 162)
			(164 168 170 166)
			(168 172 174 170)
			(172 176 178 174)
			(176 180 182 178)
			(180 184 186 182)
			(184 188 190 186)
			(188 192 194 190)
			(192 196 198 194)
			(196 200 202 198)
			(200 204 206 202)
			(204 208 210 206)
			(208 212 214 210)
			(212 216 218 214)
			(216 220 222 218)
			(220 224 226 222)
			(224 228 230 226)
			(228 232 234 230)
			(232 236 238 234)
			(236 240 242 238)
			(240 244 246 242)
			(244 248 250 246)
			(248 252 254 250)
			(252 256 258 254)
			(256 260 262 258)
			(260 264 266 262)
			(264 268 270 266)
			(268 272 274 270)
			(272 276 278 274)
			(276 280 282 278)
			(280 284 286 282)
			(284 288 290 286)
			(288 292 294 290)
			(292 296 298 294)
			(296 300 302 298)
			(300 304 306 302)
			(304 308 310 306)
			(308 312 314 310)
			(312 316 318 314)
			(316 320 322 318)
			(320 324 326 322)
			(324 328 330 326)
			(328 332 334 330)
			(332 336 338 334)
			(336 340 342 338)
			(340 344 346 342)
			(344 348 350 346)
			(348 352 354 350)
			(352 356 358 354)
			(356 360 362 358)
			(360 364 366 362)
			(364 368 370 366)
			(368 372 374 370)
			(372 376 378 374)
			(376 380 382 378)
			(380 384 386 382)
			(384 388 390 386)
			(388 392 394 390)
			(392 396 398 394)
		);
	}
	Front
	{
		type empty;
		faces
		(
			(4 5 6 7)
			(5 10 11 6)
			(10 14 15 11)
			(14 18 19 15)
			(18 22 23 19)
			(22 26 27 23)
			(26 30 31 27)
			(30 34 35 31)
			(34 38 39 35)
			(38 42 43 39)
			(42 46 47 43)
			(46 50 51 47)
			(50 54 55 51)
			(54 58 59 55)
			(58 62 63 59)
			(62 66 67 63)
			(66 70 71 67)
			(70 74 75 71)
			(74 78 79 75)
			(78 82 83 79)
			(82 86 87 83)
			(86 90 91 87)
			(90 94 95 91)
			(94 98 99 95)
			(98 102 103 99)
			(102 106 107 103)
			(106 110 111 107)
			(110 114 115 111)
			(114 118 119 115)
			(118 122 123 119)
			(122 126 127 123)
			(126 130 131 127)
			(130 134 135 131)
			(134 138 139 135)
			(138 142 143 139)
			(142 146 147 143)
			(146 150 151 147)
			(150 154 155 151)
			(154 158 159 155)
			(158 162 163 159)
			(162 166 167 163)
			(166 170 171 167)
			(170 174 175 171)
			(174 178 179 175)
			(178 182 183 179)
			(182 186 187 183)
			(186 190 191 187)
			(190 194 195 191)
			(194 198 199 195)
			(198 202 203 199)
			(202 206 207 203)
			(206 210 211 207)
			(210 214 215 211)
			(214 218 219 215)
			(218 222 223 219)
			(222 226 227 223)
			(226 230 231 227)
			(230 234 235 231)
			(234 238 239 235)
			(238 242 243 239)
			(242 246 247 243)
			(246 250 251 247)
			(250 254 255 251)
			(254 258 259 255)
			(258 262 263 259)
			(262 266 267 263)
			(266 270 271 267)
			(270 274 275 271)
			(274 278 279 275)
			(278 282 283 279)
			(282 286 287 283)
			(286 290 291 287)
			(290 294 295 291)
			(294 298 299 295)
			(298 302 303 299)
			(302 306 307 303)
			(306 310 311 307)
			(310 314 315 311)
			(314 318 319 315)
			(318 322 323 319)
			(322 326 327 323)
			(326 330 331 327)
			(330 334 335 331)
			(334 338 339 335)
			(338 342 343 339)
			(342 346 347 343)
			(346 350 351 347)
			(350 354 355 351)
			(354 358 359 355)
			(358 362 363 359)
			(362 366 367 363)
			(366 370 371 367)
			(370 374 375 371)
			(374 378 379 375)
			(378 382 383 379)
			(382 386 387 383)
			(386 390 391 387)
			(390 394 395 391)
			(394 398 399 395)
		);
	}
	Back
	{
		type empty;
		faces
		(
			(0 3 2 1)
			(1 2 9 8)
			(8 9 13 12)
			(12 13 17 16)
			(16 17 21 20)
			(20 21 25 24)
			(24 25 29 28)
			(28 29 33 32)
			(32 33 37 36)
			(36 37 41 40)
			(40 41 45 44)
			(44 45 49 48)
			(48 49 53 52)
			(52 53 57 56)
			(56 57 61 60)
			(60 61 65 64)
			(64 65 69 68)
			(68 69 73 72)
			(72 73 77 76)
			(76 77 81 80)
			(80 81 85 84)
			(84 85 89 88)
			(88 89 93 92)
			(92 93 97 96)
			(96 97 101 100)
			(100 101 105 104)
			(104 105 109 108)
			(108 109 113 112)
			(112 113 117 116)
			(116 117 121 120)
			(120 121 125 124)
			(124 125 129 128)
			(128 129 133 132)
			(132 133 137 136)
			(136 137 141 140)
			(140 141 145 144)
			(144 145 149 148)
			(148 149 153 152)
			(152 153 157 156)
			(156 157 161 160)
			(160 161 165 164)
			(164 165 169 168)
			(168 169 173 172)
			(172 173 177 176)
			(176 177 181 180)
			(180 181 185 184)
			(184 185 189 188)
			(188 189 193 192)
			(192 193 197 196)
			(196 197 201 200)
			(200 201 205 204)
			(204 205 209 208)
			(208 209 213 212)
			(212 213 217 216)
			(216 217 221 220)
			(220 221 225 224)
			(224 225 229 228)
			(228 229 233 232)
			(232 233 237 236)
			(236 237 241 240)
			(240 241 245 244)
			(244 245 249 248)
			(248 249 253 252)
			(252 253 257 256)
			(256 257 261 260)
			(260 261 265 264)
			(264 265 269 268)
			(268 269 273 272)
			(272 273 277 276)
			(276 277 281 280)
			(280 281 285 284)
			(284 285 289 288)
			(288 289 293 292)
			(292 293 297 296)
			(296 297 301 300)
			(300 301 305 304)
			(304 305 309 308)
			(308 309 313 312)
			(312 313 317 316)
			(316 317 321 320)
			(320 321 325 324)
			(324 325 329 328)
			(328 329 333 332)
			(332 333 337 336)
			(336 337 341 340)
			(340 341 345 344)
			(344 345 349 348)
			(348 349 353 352)
			(352 353 357 356)
			(356 357 361 360)
			(360 361 365 364)
			(364 365 369 368)
			(368 369 373 372)
			(372 373 377 376)
			(376 377 381 380)
			(380 381 385 384)
			(384 385 389 388)
			(388 389 393 392)
			(392 393 397 396)
		);
	}
	Inlet
	{
		type patch;
		faces
		(
			(4 7 3 0)
		);
	}
	Outlet
	{
		type patch;
		faces
		(
			(396 397 399 398)
		);
	}
);

mergePatchPairs
(
);

// ************************************************************************* //